       >>SOURCE FORMAT FREE
*>**
*>  The loader generated automatically
*>**

copy "src/connecttoserver" of "libs/core/network".
copy "src/network" of "libs/core/network".
