       >>SOURCE FORMAT FREE
*>**
*>  The loader generated automatically
*>**

copy "src/keccak" of "libs/core/string".
copy "src/string" of "libs/core/string".
copy "src/hash" of "libs/core/string".
